---
kind: method
id: M:Autodesk.Revit.DB.ScheduleFilter.SetValue(System.String)
source: html/9556c7a1-1bf9-2844-3357-ada1c0f653de.htm
---
# Autodesk.Revit.DB.ScheduleFilter.SetValue Method

Set the filter value to a string.

## Syntax (C#)
```csharp
public void SetValue(
	string string
)
```

## Parameters
- **string** (`System.String`) - The filter value.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null